# ДЗ 25. Генераторная функция
#
# Реализуйте генераторную функцию (с использованием оператора yield), которая будет возвращать по одному члену числовой последовательности,
# закон которой задается с помощью пользовательской функции. Кроме этого параметром генераторной функции должны быть значение первого члена
# прогрессии и количество выдаваемых членов последовательности (n). Генератор должен остановить свою работу по достижению n — го члена.я
#
# Пример пользовательской функции:
#
# def pow(x):
#     return x ** 2
#
#
# Намек на генераторную функцию:
#
# def some_gen(begin, end, func):
#     """
#     begin: первый член последовательности
#     end: кол-во элементов в последовательности
#     func: функция, которая формирует значения для последовательности
#     """
#     ....
#     yield begin
# Вариант вызова ген. функции (но можно и в цикле пройтись по результату):
#
# print(list(some_gen(2, 4, pow)))
# [2, 4, 16, 256]
#
#
# Подсказка: эта задача очень сильно похожа на бесконечный счетчик из материалов лекции! Нужно лишь ограничить кол-во выдаваемых генератором значений!

def pow(x):
    return x ** 2


def some_gen(begin, end, func):
    for i in range(end):
        yield begin
        begin = func(begin)


print(list(some_gen(2, 4, pow)))




